MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB606/mcu.h
#define _OSCFDIV_TRIM8_POSITION                  0x00000007
#define _OSCFDIV_TRIM8_MASK                      0x00000080
#define _OSCFDIV_TRIM8_LENGTH                    0x00000001

#define _OSCFDIV_TRIM7_POSITION                  0x00000008
#define _OSCFDIV_TRIM7_MASK                      0x00000100
#define _OSCFDIV_TRIM7_LENGTH                    0x00000001

#define _OSCFDIV_TRIM6_POSITION                  0x00000009
#define _OSCFDIV_TRIM6_MASK                      0x00000200
#define _OSCFDIV_TRIM6_LENGTH                    0x00000001

#define _OSCFDIV_TRIM5_POSITION                  0x0000000A
#define _OSCFDIV_TRIM5_MASK                      0x00000400
#define _OSCFDIV_TRIM5_LENGTH                    0x00000001

#define _OSCFDIV_TRIM4_POSITION                  0x0000000B
#define _OSCFDIV_TRIM4_MASK                      0x00000800
#define _OSCFDIV_TRIM4_LENGTH                    0x00000001

#define _OSCFDIV_TRIM3_POSITION                  0x0000000C
#define _OSCFDIV_TRIM3_MASK                      0x00001000
#define _OSCFDIV_TRIM3_LENGTH                    0x00000001

#define _OSCFDIV_TRIM2_POSITION                  0x0000000D
#define _OSCFDIV_TRIM2_MASK                      0x00002000
#define _OSCFDIV_TRIM2_LENGTH                    0x00000001

#define _OSCFDIV_TRIM1_POSITION                  0x0000000E
#define _OSCFDIV_TRIM1_MASK                      0x00004000
#define _OSCFDIV_TRIM1_LENGTH                    0x00000001

#define _OSCFDIV_TRIM0_POSITION                  0x0000000F
#define _OSCFDIV_TRIM0_MASK                      0x00008000
#define _OSCFDIV_TRIM0_LENGTH                    0x00000001

#define _RCON_POR_POSITION                       0x00000000
#define _RCON_POR_MASK                           0x00000001
#define _RCON_POR_LENGTH                         0x00000001

#define _RCON_BOR_POSITION                       0x00000001
#define _RCON_BOR_MASK                           0x00000002
#define _RCON_BOR_LENGTH                         0x00000001

#define _RCON_IDLE_POSITION                      0x00000002
#define _RCON_IDLE_MASK                          0x00000004
#define _RCON_IDLE_LENGTH                        0x00000001

#define _RCON_SLEEP_POSITION                     0x00000003
#define _RCON_SLEEP_MASK                         0x00000008
#define _RCON_SLEEP_LENGTH                       0x00000001

#define _RCON_WDTO_POSITION                      0x00000004
#define _RCON_WDTO_MASK                          0x00000010
#define _RCON_WDTO_LENGTH                        0x00000001

#define _RCON_SWDTEN_POSITION                    0x00000005
#define _RCON_SWDTEN_MASK                        0x00000020
#define _RCON_SWDTEN_LENGTH                      0x00000001

#define _RCON_SWR_POSITION                       0x00000006
#define _RCON_SWR_MASK                           0x00000040
#define _RCON_SWR_LENGTH                         0x00000001

#define _RCON_EXTR_POSITION                      0x00000007
#define _RCON_EXTR_MASK                          0x00000080
#define _RCON_EXTR_LENGTH                        0x00000001

#define _RCON_VREGS_POSITION                     0x00000008
#define _RCON_VREGS_MASK                         0x00000100
#define _RCON_VREGS_LENGTH                       0x00000001

#define _RCON_CM_POSITION                        0x00000009
#define _RCON_CM_MASK                            0x00000200
#define _RCON_CM_LENGTH                          0x00000001

#define _RCON_RETEN_POSITION                     0x0000000C
#define _RCON_RETEN_MASK                         0x00001000
#define _RCON_RETEN_LENGTH                       0x00000001

#define _RCON_SBOREN_POSITION                    0x0000000D
#define _RCON_SBOREN_MASK                        0x00002000
#define _RCON_SBOREN_LENGTH                      0x00000001

#define _RCON_IOPUWR_POSITION                    0x0000000E
#define _RCON_IOPUWR_MASK                        0x00004000
#define _RCON_IOPUWR_LENGTH                      0x00000001

#define _RCON_TRAPR_POSITION                     0x0000000F
#define _RCON_TRAPR_MASK                         0x00008000
#define _RCON_TRAPR_LENGTH                       0x00000001

#define _RCON_PMSLP_POSITION                     0x00000008
#define _RCON_PMSLP_MASK                         0x00000100
#define _RCON_PMSLP_LENGTH                       0x00000001

#define _HLVDCON_HLVDL_POSITION                  0x00000000
#define _HLVDCON_HLVDL_MASK                      0x0000000F
#define _HLVDCON_HLVDL_LENGTH                    0x00000004

#define _HLVDCON_LVDEVT_POSITION                 0x00000008
#define _HLVDCON_LVDEVT_MASK                     0x00000100
#define _HLVDCON_LVDEVT_LENGTH                   0x00000001

#define _HLVDCON_IRVST_POSITION                  0x00000009
#define _HLVDCON_IRVST_MASK                      0x00000200
#define _HLVDCON_IRVST_LENGTH                    0x00000001

#define _HLVDCON_BGVST_POSITION                  0x0000000A
#define _HLVDCON_BGVST_MASK                      0x00000400
#define _HLVDCON_BGVST_LENGTH                    0x00000001

#define _HLVDCON_VDIR_POSITION                   0x0000000B
#define _HLVDCON_VDIR_MASK                       0x00000800
#define _HLVDCON_VDIR_LENGTH                     0x00000001

#define _HLVDCON_LSIDL_POSITION                  0x0000000D
#define _HLVDCON_LSIDL_MASK                      0x00002000
#define _HLVDCON_LSIDL_LENGTH                    0x00000001

#define _HLVDCON_HLVDEN_POSITION                 0x0000000F
#define _HLVDCON_HLVDEN_MASK                     0x00008000
#define _HLVDCON_HLVDEN_LENGTH                   0x00000001

#define _HLVDCON_HLVDL0_POSITION                 0x00000000
#define _HLVDCON_HLVDL0_MASK                     0x00000001
#define _HLVDCON_HLVDL0_LENGTH                   0x00000001

#define _HLVDCON_HLVDL1_POSITION                 0x00000001
#define _HLVDCON_HLVDL1_MASK                     0x00000002
#define _HLVDCON_HLVDL1_LENGTH                   0x00000001

#define _HLVDCON_HLVDL2_POSITION                 0x00000002
#define _HLVDCON_HLVDL2_MASK                     0x00000004
#define _HLVDCON_HLVDL2_LENGTH                   0x00000001

