MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB606/mcu.h
#define _REFOCONL_ROSIDL_POSITION                0x0000000D
#define _REFOCONL_ROSIDL_MASK                    0x00002000
#define _REFOCONL_ROSIDL_LENGTH                  0x00000001

#define _REFOCONL_ROEN_POSITION                  0x0000000F
#define _REFOCONL_ROEN_MASK                      0x00008000
#define _REFOCONL_ROEN_LENGTH                    0x00000001

#define _REFOCONL_ROSEL0_POSITION                0x00000000
#define _REFOCONL_ROSEL0_MASK                    0x00000001
#define _REFOCONL_ROSEL0_LENGTH                  0x00000001

#define _REFOCONL_ROSEL1_POSITION                0x00000001
#define _REFOCONL_ROSEL1_MASK                    0x00000002
#define _REFOCONL_ROSEL1_LENGTH                  0x00000001

#define _REFOCONL_ROSEL2_POSITION                0x00000002
#define _REFOCONL_ROSEL2_MASK                    0x00000004
#define _REFOCONL_ROSEL2_LENGTH                  0x00000001

#define _REFOCONL_ROSEL3_POSITION                0x00000003
#define _REFOCONL_ROSEL3_MASK                    0x00000008
#define _REFOCONL_ROSEL3_LENGTH                  0x00000001

#define _REFOCON2_RODIV_POSITION                 0x00000000
#define _REFOCON2_RODIV_MASK                     0x00007FFF
#define _REFOCON2_RODIV_LENGTH                   0x0000000F

#define _REFOCON2_RODIV0_POSITION                0x00000000
#define _REFOCON2_RODIV0_MASK                    0x00000001
#define _REFOCON2_RODIV0_LENGTH                  0x00000001

#define _REFOCON2_RODIV1_POSITION                0x00000001
#define _REFOCON2_RODIV1_MASK                    0x00000002
#define _REFOCON2_RODIV1_LENGTH                  0x00000001

#define _REFOCON2_RODIV2_POSITION                0x00000002
#define _REFOCON2_RODIV2_MASK                    0x00000004
#define _REFOCON2_RODIV2_LENGTH                  0x00000001

#define _REFOCON2_RODIV3_POSITION                0x00000003
#define _REFOCON2_RODIV3_MASK                    0x00000008
#define _REFOCON2_RODIV3_LENGTH                  0x00000001

#define _REFOCON2_RODIV4_POSITION                0x00000004
#define _REFOCON2_RODIV4_MASK                    0x00000010
#define _REFOCON2_RODIV4_LENGTH                  0x00000001

#define _REFOCON2_RODIV5_POSITION                0x00000005
#define _REFOCON2_RODIV5_MASK                    0x00000020
#define _REFOCON2_RODIV5_LENGTH                  0x00000001

#define _REFOCON2_RODIV6_POSITION                0x00000006
#define _REFOCON2_RODIV6_MASK                    0x00000040
#define _REFOCON2_RODIV6_LENGTH                  0x00000001

#define _REFOCON2_RODIV7_POSITION                0x00000007
#define _REFOCON2_RODIV7_MASK                    0x00000080
#define _REFOCON2_RODIV7_LENGTH                  0x00000001

#define _REFOCON2_RODIV8_POSITION                0x00000008
#define _REFOCON2_RODIV8_MASK                    0x00000100
#define _REFOCON2_RODIV8_LENGTH                  0x00000001

#define _REFOCON2_RODIV9_POSITION                0x00000009
#define _REFOCON2_RODIV9_MASK                    0x00000200
#define _REFOCON2_RODIV9_LENGTH                  0x00000001

#define _REFOCON2_RODIV10_POSITION               0x0000000A
#define _REFOCON2_RODIV10_MASK                   0x00000400
#define _REFOCON2_RODIV10_LENGTH                 0x00000001

#define _REFOCON2_RODIV11_POSITION               0x0000000B
#define _REFOCON2_RODIV11_MASK                   0x00000800
#define _REFOCON2_RODIV11_LENGTH                 0x00000001

#define _REFOCON2_RODIV12_POSITION               0x0000000C
#define _REFOCON2_RODIV12_MASK                   0x00001000
#define _REFOCON2_RODIV12_LENGTH                 0x00000001

#define _REFOCON2_RODIV13_POSITION               0x0000000D
#define _REFOCON2_RODIV13_MASK                   0x00002000
#define _REFOCON2_RODIV13_LENGTH                 0x00000001

#define _REFOCON2_RODIV14_POSITION               0x0000000E
#define _REFOCON2_RODIV14_MASK                   0x00004000
#define _REFOCON2_RODIV14_LENGTH                 0x00000001

#define _REFOCONH_RODIV_POSITION                 0x00000000
#define _REFOCONH_RODIV_MASK                     0x00007FFF
#define _REFOCONH_RODIV_LENGTH                   0x0000000F

#define _REFOCONH_RODIV0_POSITION                0x00000000
#define _REFOCONH_RODIV0_MASK                    0x00000001
#define _REFOCONH_RODIV0_LENGTH                  0x00000001

#define _REFOCONH_RODIV1_POSITION                0x00000001
#define _REFOCONH_RODIV1_MASK                    0x00000002
#define _REFOCONH_RODIV1_LENGTH                  0x00000001

#define _REFOCONH_RODIV2_POSITION                0x00000002
#define _REFOCONH_RODIV2_MASK                    0x00000004
#define _REFOCONH_RODIV2_LENGTH                  0x00000001

#define _REFOCONH_RODIV3_POSITION                0x00000003
#define _REFOCONH_RODIV3_MASK                    0x00000008
#define _REFOCONH_RODIV3_LENGTH                  0x00000001

#define _REFOCONH_RODIV4_POSITION                0x00000004
#define _REFOCONH_RODIV4_MASK                    0x00000010
#define _REFOCONH_RODIV4_LENGTH                  0x00000001

#define _REFOCONH_RODIV5_POSITION                0x00000005
#define _REFOCONH_RODIV5_MASK                    0x00000020
#define _REFOCONH_RODIV5_LENGTH                  0x00000001

#define _REFOCONH_RODIV6_POSITION                0x00000006
#define _REFOCONH_RODIV6_MASK                    0x00000040
#define _REFOCONH_RODIV6_LENGTH                  0x00000001

#define _REFOCONH_RODIV7_POSITION                0x00000007
#define _REFOCONH_RODIV7_MASK                    0x00000080
#define _REFOCONH_RODIV7_LENGTH                  0x00000001

#define _REFOCONH_RODIV8_POSITION                0x00000008
#define _REFOCONH_RODIV8_MASK                    0x00000100
#define _REFOCONH_RODIV8_LENGTH                  0x00000001

#define _REFOCONH_RODIV9_POSITION                0x00000009
#define _REFOCONH_RODIV9_MASK                    0x00000200
#define _REFOCONH_RODIV9_LENGTH                  0x00000001

#define _REFOCONH_RODIV10_POSITION               0x0000000A
#define _REFOCONH_RODIV10_MASK                   0x00000400
#define _REFOCONH_RODIV10_LENGTH                 0x00000001

#define _REFOCONH_RODIV11_POSITION               0x0000000B
#define _REFOCONH_RODIV11_MASK                   0x00000800
#define _REFOCONH_RODIV11_LENGTH                 0x00000001

#define _REFOCONH_RODIV12_POSITION               0x0000000C
#define _REFOCONH_RODIV12_MASK                   0x00001000
#define _REFOCONH_RODIV12_LENGTH                 0x00000001

#define _REFOCONH_RODIV13_POSITION               0x0000000D
#define _REFOCONH_RODIV13_MASK                   0x00002000
#define _REFOCONH_RODIV13_LENGTH                 0x00000001

