MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB606/mcu.h
#define _DMACH5_RELOAD_POSITION                  0x00000009
#define _DMACH5_RELOAD_MASK                      0x00000200
#define _DMACH5_RELOAD_LENGTH                    0x00000001

#define _DMACH5_NULLW_POSITION                   0x0000000A
#define _DMACH5_NULLW_MASK                       0x00000400
#define _DMACH5_NULLW_LENGTH                     0x00000001

#define _DMACH5_TRMODE0_POSITION                 0x00000002
#define _DMACH5_TRMODE0_MASK                     0x00000004
#define _DMACH5_TRMODE0_LENGTH                   0x00000001

#define _DMACH5_TRMODE1_POSITION                 0x00000003
#define _DMACH5_TRMODE1_MASK                     0x00000008
#define _DMACH5_TRMODE1_LENGTH                   0x00000001

#define _DMACH5_DAMODE0_POSITION                 0x00000004
#define _DMACH5_DAMODE0_MASK                     0x00000010
#define _DMACH5_DAMODE0_LENGTH                   0x00000001

#define _DMACH5_DAMODE1_POSITION                 0x00000005
#define _DMACH5_DAMODE1_MASK                     0x00000020
#define _DMACH5_DAMODE1_LENGTH                   0x00000001

#define _DMACH5_SAMODE0_POSITION                 0x00000006
#define _DMACH5_SAMODE0_MASK                     0x00000040
#define _DMACH5_SAMODE0_LENGTH                   0x00000001

#define _DMACH5_SAMODE1_POSITION                 0x00000007
#define _DMACH5_SAMODE1_MASK                     0x00000080
#define _DMACH5_SAMODE1_LENGTH                   0x00000001

#define _DMAINT5_HALFEN_POSITION                 0x00000000
#define _DMAINT5_HALFEN_MASK                     0x00000001
#define _DMAINT5_HALFEN_LENGTH                   0x00000001

#define _DMAINT5_OVRUNIF_POSITION                0x00000003
#define _DMAINT5_OVRUNIF_MASK                    0x00000008
#define _DMAINT5_OVRUNIF_LENGTH                  0x00000001

#define _DMAINT5_HALFIF_POSITION                 0x00000004
#define _DMAINT5_HALFIF_MASK                     0x00000010
#define _DMAINT5_HALFIF_LENGTH                   0x00000001

#define _DMAINT5_DONEIF_POSITION                 0x00000005
#define _DMAINT5_DONEIF_MASK                     0x00000020
#define _DMAINT5_DONEIF_LENGTH                   0x00000001

#define _DMAINT5_LOWIF_POSITION                  0x00000006
#define _DMAINT5_LOWIF_MASK                      0x00000040
#define _DMAINT5_LOWIF_LENGTH                    0x00000001

#define _DMAINT5_HIGHIF_POSITION                 0x00000007
#define _DMAINT5_HIGHIF_MASK                     0x00000080
#define _DMAINT5_HIGHIF_LENGTH                   0x00000001

#define _DMAINT5_CHSEL_POSITION                  0x00000008
#define _DMAINT5_CHSEL_MASK                      0x00007F00
#define _DMAINT5_CHSEL_LENGTH                    0x00000007

#define _DMAINT5_DBUFWF_POSITION                 0x0000000F
#define _DMAINT5_DBUFWF_MASK                     0x00008000
#define _DMAINT5_DBUFWF_LENGTH                   0x00000001

#define _DMAINT5_CHSEL0_POSITION                 0x00000008
#define _DMAINT5_CHSEL0_MASK                     0x00000100
#define _DMAINT5_CHSEL0_LENGTH                   0x00000001

#define _DMAINT5_CHSEL1_POSITION                 0x00000009
#define _DMAINT5_CHSEL1_MASK                     0x00000200
#define _DMAINT5_CHSEL1_LENGTH                   0x00000001

#define _DMAINT5_CHSEL2_POSITION                 0x0000000A
#define _DMAINT5_CHSEL2_MASK                     0x00000400
#define _DMAINT5_CHSEL2_LENGTH                   0x00000001

#define _DMAINT5_CHSEL3_POSITION                 0x0000000B
#define _DMAINT5_CHSEL3_MASK                     0x00000800
#define _DMAINT5_CHSEL3_LENGTH                   0x00000001

#define _DMAINT5_CHSEL4_POSITION                 0x0000000C
#define _DMAINT5_CHSEL4_MASK                     0x00001000
#define _DMAINT5_CHSEL4_LENGTH                   0x00000001

#define _DMAINT5_CHSEL5_POSITION                 0x0000000D
#define _DMAINT5_CHSEL5_MASK                     0x00002000
#define _DMAINT5_CHSEL5_LENGTH                   0x00000001

#define _DMAINT5_CHSEL6_POSITION                 0x0000000E
#define _DMAINT5_CHSEL6_MASK                     0x00004000
#define _DMAINT5_CHSEL6_LENGTH                   0x00000001

#define _DMACH6_CHEN_POSITION                    0x00000000
#define _DMACH6_CHEN_MASK                        0x00000001
#define _DMACH6_CHEN_LENGTH                      0x00000001

#define _DMACH6_SIZE_POSITION                    0x00000001
#define _DMACH6_SIZE_MASK                        0x00000002
#define _DMACH6_SIZE_LENGTH                      0x00000001

#define _DMACH6_TRMODE_POSITION                  0x00000002
#define _DMACH6_TRMODE_MASK                      0x0000000C
#define _DMACH6_TRMODE_LENGTH                    0x00000002

#define _DMACH6_DAMODE_POSITION                  0x00000004
#define _DMACH6_DAMODE_MASK                      0x00000030
#define _DMACH6_DAMODE_LENGTH                    0x00000002

#define _DMACH6_SAMODE_POSITION                  0x00000006
#define _DMACH6_SAMODE_MASK                      0x000000C0
#define _DMACH6_SAMODE_LENGTH                    0x00000002

#define _DMACH6_CHREQ_POSITION                   0x00000008
#define _DMACH6_CHREQ_MASK                       0x00000100
#define _DMACH6_CHREQ_LENGTH                     0x00000001

#define _DMACH6_RELOAD_POSITION                  0x00000009
#define _DMACH6_RELOAD_MASK                      0x00000200
#define _DMACH6_RELOAD_LENGTH                    0x00000001

#define _DMACH6_NULLW_POSITION                   0x0000000A
#define _DMACH6_NULLW_MASK                       0x00000400
#define _DMACH6_NULLW_LENGTH                     0x00000001

#define _DMACH6_TRMODE0_POSITION                 0x00000002
#define _DMACH6_TRMODE0_MASK                     0x00000004
#define _DMACH6_TRMODE0_LENGTH                   0x00000001

#define _DMACH6_TRMODE1_POSITION                 0x00000003
#define _DMACH6_TRMODE1_MASK                     0x00000008
#define _DMACH6_TRMODE1_LENGTH                   0x00000001

#define _DMACH6_DAMODE0_POSITION                 0x00000004
#define _DMACH6_DAMODE0_MASK                     0x00000010
#define _DMACH6_DAMODE0_LENGTH                   0x00000001

#define _DMACH6_DAMODE1_POSITION                 0x00000005
#define _DMACH6_DAMODE1_MASK                     0x00000020
#define _DMACH6_DAMODE1_LENGTH                   0x00000001

#define _DMACH6_SAMODE0_POSITION                 0x00000006
#define _DMACH6_SAMODE0_MASK                     0x00000040
#define _DMACH6_SAMODE0_LENGTH                   0x00000001

#define _DMACH6_SAMODE1_POSITION                 0x00000007
#define _DMACH6_SAMODE1_MASK                     0x00000080
#define _DMACH6_SAMODE1_LENGTH                   0x00000001

