MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB606/mcu.h
#define _CNPUD_IOCPD4_POSITION                   0x00000004
#define _CNPUD_IOCPD4_MASK                       0x00000010
#define _CNPUD_IOCPD4_LENGTH                     0x00000001

#define _CNPUD_IOCPD5_POSITION                   0x00000005
#define _CNPUD_IOCPD5_MASK                       0x00000020
#define _CNPUD_IOCPD5_LENGTH                     0x00000001

#define _CNPUD_IOCPD6_POSITION                   0x00000006
#define _CNPUD_IOCPD6_MASK                       0x00000040
#define _CNPUD_IOCPD6_LENGTH                     0x00000001

#define _CNPUD_IOCPD7_POSITION                   0x00000007
#define _CNPUD_IOCPD7_MASK                       0x00000080
#define _CNPUD_IOCPD7_LENGTH                     0x00000001

#define _CNPUD_IOCPD8_POSITION                   0x00000008
#define _CNPUD_IOCPD8_MASK                       0x00000100
#define _CNPUD_IOCPD8_LENGTH                     0x00000001

#define _CNPUD_IOCPD9_POSITION                   0x00000009
#define _CNPUD_IOCPD9_MASK                       0x00000200
#define _CNPUD_IOCPD9_LENGTH                     0x00000001

#define _CNPUD_IOCPD10_POSITION                  0x0000000A
#define _CNPUD_IOCPD10_MASK                      0x00000400
#define _CNPUD_IOCPD10_LENGTH                    0x00000001

#define _CNPUD_IOCPD11_POSITION                  0x0000000B
#define _CNPUD_IOCPD11_MASK                      0x00000800
#define _CNPUD_IOCPD11_LENGTH                    0x00000001

#define _CNPUD_IOCPUD0_POSITION                  0x00000000
#define _CNPUD_IOCPUD0_MASK                      0x00000001
#define _CNPUD_IOCPUD0_LENGTH                    0x00000001

#define _CNPUD_IOCPUD1_POSITION                  0x00000001
#define _CNPUD_IOCPUD1_MASK                      0x00000002
#define _CNPUD_IOCPUD1_LENGTH                    0x00000001

#define _CNPUD_IOCPUD2_POSITION                  0x00000002
#define _CNPUD_IOCPUD2_MASK                      0x00000004
#define _CNPUD_IOCPUD2_LENGTH                    0x00000001

#define _CNPUD_IOCPUD3_POSITION                  0x00000003
#define _CNPUD_IOCPUD3_MASK                      0x00000008
#define _CNPUD_IOCPUD3_LENGTH                    0x00000001

#define _CNPUD_IOCPUD4_POSITION                  0x00000004
#define _CNPUD_IOCPUD4_MASK                      0x00000010
#define _CNPUD_IOCPUD4_LENGTH                    0x00000001

#define _CNPUD_IOCPUD5_POSITION                  0x00000005
#define _CNPUD_IOCPUD5_MASK                      0x00000020
#define _CNPUD_IOCPUD5_LENGTH                    0x00000001

#define _CNPUD_IOCPUD6_POSITION                  0x00000006
#define _CNPUD_IOCPUD6_MASK                      0x00000040
#define _CNPUD_IOCPUD6_LENGTH                    0x00000001

#define _CNPUD_IOCPUD7_POSITION                  0x00000007
#define _CNPUD_IOCPUD7_MASK                      0x00000080
#define _CNPUD_IOCPUD7_LENGTH                    0x00000001

#define _CNPUD_IOCPUD8_POSITION                  0x00000008
#define _CNPUD_IOCPUD8_MASK                      0x00000100
#define _CNPUD_IOCPUD8_LENGTH                    0x00000001

#define _CNPUD_IOCPUD9_POSITION                  0x00000009
#define _CNPUD_IOCPUD9_MASK                      0x00000200
#define _CNPUD_IOCPUD9_LENGTH                    0x00000001

#define _CNPUD_IOCPUD10_POSITION                 0x0000000A
#define _CNPUD_IOCPUD10_MASK                     0x00000400
#define _CNPUD_IOCPUD10_LENGTH                   0x00000001

#define _CNPUD_IOCPUD11_POSITION                 0x0000000B
#define _CNPUD_IOCPUD11_MASK                     0x00000800
#define _CNPUD_IOCPUD11_LENGTH                   0x00000001

#define _CNPUD_CNPUD0_POSITION                   0x00000000
#define _CNPUD_CNPUD0_MASK                       0x00000001
#define _CNPUD_CNPUD0_LENGTH                     0x00000001

#define _CNPUD_CNPUD1_POSITION                   0x00000001
#define _CNPUD_CNPUD1_MASK                       0x00000002
#define _CNPUD_CNPUD1_LENGTH                     0x00000001

#define _CNPUD_CNPUD2_POSITION                   0x00000002
#define _CNPUD_CNPUD2_MASK                       0x00000004
#define _CNPUD_CNPUD2_LENGTH                     0x00000001

#define _CNPUD_CNPUD3_POSITION                   0x00000003
#define _CNPUD_CNPUD3_MASK                       0x00000008
#define _CNPUD_CNPUD3_LENGTH                     0x00000001

#define _CNPUD_CNPUD4_POSITION                   0x00000004
#define _CNPUD_CNPUD4_MASK                       0x00000010
#define _CNPUD_CNPUD4_LENGTH                     0x00000001

#define _CNPUD_CNPUD5_POSITION                   0x00000005
#define _CNPUD_CNPUD5_MASK                       0x00000020
#define _CNPUD_CNPUD5_LENGTH                     0x00000001

#define _CNPUD_CNPUD6_POSITION                   0x00000006
#define _CNPUD_CNPUD6_MASK                       0x00000040
#define _CNPUD_CNPUD6_LENGTH                     0x00000001

#define _CNPUD_CNPUD7_POSITION                   0x00000007
#define _CNPUD_CNPUD7_MASK                       0x00000080
#define _CNPUD_CNPUD7_LENGTH                     0x00000001

#define _CNPUD_CNPUD8_POSITION                   0x00000008
#define _CNPUD_CNPUD8_MASK                       0x00000100
#define _CNPUD_CNPUD8_LENGTH                     0x00000001

#define _CNPUD_CNPUD9_POSITION                   0x00000009
#define _CNPUD_CNPUD9_MASK                       0x00000200
#define _CNPUD_CNPUD9_LENGTH                     0x00000001

#define _CNPUD_CNPUD10_POSITION                  0x0000000A
#define _CNPUD_CNPUD10_MASK                      0x00000400
#define _CNPUD_CNPUD10_LENGTH                    0x00000001

#define _CNPUD_CNPUD11_POSITION                  0x0000000B
#define _CNPUD_CNPUD11_MASK                      0x00000800
#define _CNPUD_CNPUD11_LENGTH                    0x00000001

#define _IOCPUD_IOCPD0_POSITION                  0x00000000
#define _IOCPUD_IOCPD0_MASK                      0x00000001
#define _IOCPUD_IOCPD0_LENGTH                    0x00000001

#define _IOCPUD_IOCPD1_POSITION                  0x00000001
#define _IOCPUD_IOCPD1_MASK                      0x00000002
#define _IOCPUD_IOCPD1_LENGTH                    0x00000001

