MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB606/mcu.h
#define _CNPDD_IOCPDD2_POSITION                  0x00000002
#define _CNPDD_IOCPDD2_MASK                      0x00000004
#define _CNPDD_IOCPDD2_LENGTH                    0x00000001

#define _CNPDD_IOCPDD3_POSITION                  0x00000003
#define _CNPDD_IOCPDD3_MASK                      0x00000008
#define _CNPDD_IOCPDD3_LENGTH                    0x00000001

#define _CNPDD_IOCPDD4_POSITION                  0x00000004
#define _CNPDD_IOCPDD4_MASK                      0x00000010
#define _CNPDD_IOCPDD4_LENGTH                    0x00000001

#define _CNPDD_IOCPDD5_POSITION                  0x00000005
#define _CNPDD_IOCPDD5_MASK                      0x00000020
#define _CNPDD_IOCPDD5_LENGTH                    0x00000001

#define _CNPDD_IOCPDD6_POSITION                  0x00000006
#define _CNPDD_IOCPDD6_MASK                      0x00000040
#define _CNPDD_IOCPDD6_LENGTH                    0x00000001

#define _CNPDD_IOCPDD7_POSITION                  0x00000007
#define _CNPDD_IOCPDD7_MASK                      0x00000080
#define _CNPDD_IOCPDD7_LENGTH                    0x00000001

#define _CNPDD_IOCPDD8_POSITION                  0x00000008
#define _CNPDD_IOCPDD8_MASK                      0x00000100
#define _CNPDD_IOCPDD8_LENGTH                    0x00000001

#define _CNPDD_IOCPDD9_POSITION                  0x00000009
#define _CNPDD_IOCPDD9_MASK                      0x00000200
#define _CNPDD_IOCPDD9_LENGTH                    0x00000001

#define _CNPDD_IOCPDD10_POSITION                 0x0000000A
#define _CNPDD_IOCPDD10_MASK                     0x00000400
#define _CNPDD_IOCPDD10_LENGTH                   0x00000001

#define _CNPDD_IOCPDD11_POSITION                 0x0000000B
#define _CNPDD_IOCPDD11_MASK                     0x00000800
#define _CNPDD_IOCPDD11_LENGTH                   0x00000001

#define _CNPDD_CNPDD0_POSITION                   0x00000000
#define _CNPDD_CNPDD0_MASK                       0x00000001
#define _CNPDD_CNPDD0_LENGTH                     0x00000001

#define _CNPDD_CNPDD1_POSITION                   0x00000001
#define _CNPDD_CNPDD1_MASK                       0x00000002
#define _CNPDD_CNPDD1_LENGTH                     0x00000001

#define _CNPDD_CNPDD2_POSITION                   0x00000002
#define _CNPDD_CNPDD2_MASK                       0x00000004
#define _CNPDD_CNPDD2_LENGTH                     0x00000001

#define _CNPDD_CNPDD3_POSITION                   0x00000003
#define _CNPDD_CNPDD3_MASK                       0x00000008
#define _CNPDD_CNPDD3_LENGTH                     0x00000001

#define _CNPDD_CNPDD4_POSITION                   0x00000004
#define _CNPDD_CNPDD4_MASK                       0x00000010
#define _CNPDD_CNPDD4_LENGTH                     0x00000001

#define _CNPDD_CNPDD5_POSITION                   0x00000005
#define _CNPDD_CNPDD5_MASK                       0x00000020
#define _CNPDD_CNPDD5_LENGTH                     0x00000001

#define _CNPDD_CNPDD6_POSITION                   0x00000006
#define _CNPDD_CNPDD6_MASK                       0x00000040
#define _CNPDD_CNPDD6_LENGTH                     0x00000001

#define _CNPDD_CNPDD7_POSITION                   0x00000007
#define _CNPDD_CNPDD7_MASK                       0x00000080
#define _CNPDD_CNPDD7_LENGTH                     0x00000001

#define _CNPDD_CNPDD8_POSITION                   0x00000008
#define _CNPDD_CNPDD8_MASK                       0x00000100
#define _CNPDD_CNPDD8_LENGTH                     0x00000001

#define _CNPDD_CNPDD9_POSITION                   0x00000009
#define _CNPDD_CNPDD9_MASK                       0x00000200
#define _CNPDD_CNPDD9_LENGTH                     0x00000001

#define _CNPDD_CNPDD10_POSITION                  0x0000000A
#define _CNPDD_CNPDD10_MASK                      0x00000400
#define _CNPDD_CNPDD10_LENGTH                    0x00000001

#define _CNPDD_CNPDD11_POSITION                  0x0000000B
#define _CNPDD_CNPDD11_MASK                      0x00000800
#define _CNPDD_CNPDD11_LENGTH                    0x00000001

#define _IOCPDD_IOCPDD0_POSITION                 0x00000000
#define _IOCPDD_IOCPDD0_MASK                     0x00000001
#define _IOCPDD_IOCPDD0_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD1_POSITION                 0x00000001
#define _IOCPDD_IOCPDD1_MASK                     0x00000002
#define _IOCPDD_IOCPDD1_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD2_POSITION                 0x00000002
#define _IOCPDD_IOCPDD2_MASK                     0x00000004
#define _IOCPDD_IOCPDD2_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD3_POSITION                 0x00000003
#define _IOCPDD_IOCPDD3_MASK                     0x00000008
#define _IOCPDD_IOCPDD3_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD4_POSITION                 0x00000004
#define _IOCPDD_IOCPDD4_MASK                     0x00000010
#define _IOCPDD_IOCPDD4_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD5_POSITION                 0x00000005
#define _IOCPDD_IOCPDD5_MASK                     0x00000020
#define _IOCPDD_IOCPDD5_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD6_POSITION                 0x00000006
#define _IOCPDD_IOCPDD6_MASK                     0x00000040
#define _IOCPDD_IOCPDD6_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD7_POSITION                 0x00000007
#define _IOCPDD_IOCPDD7_MASK                     0x00000080
#define _IOCPDD_IOCPDD7_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD8_POSITION                 0x00000008
#define _IOCPDD_IOCPDD8_MASK                     0x00000100
#define _IOCPDD_IOCPDD8_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD9_POSITION                 0x00000009
#define _IOCPDD_IOCPDD9_MASK                     0x00000200
#define _IOCPDD_IOCPDD9_LENGTH                   0x00000001

#define _IOCPDD_IOCPDD10_POSITION                0x0000000A
#define _IOCPDD_IOCPDD10_MASK                    0x00000400
#define _IOCPDD_IOCPDD10_LENGTH                  0x00000001

#define _IOCPDD_IOCPDD11_POSITION                0x0000000B
#define _IOCPDD_IOCPDD11_MASK                    0x00000800
#define _IOCPDD_IOCPDD11_LENGTH                  0x00000001

#define _IOCPDD_CNPDD0_POSITION                  0x00000000
#define _IOCPDD_CNPDD0_MASK                      0x00000001
#define _IOCPDD_CNPDD0_LENGTH                    0x00000001

#define _IOCPDD_CNPDD1_POSITION                  0x00000001
#define _IOCPDD_CNPDD1_MASK                      0x00000002
#define _IOCPDD_CNPDD1_LENGTH                    0x00000001

#define _IOCPDD_CNPDD2_POSITION                  0x00000002
#define _IOCPDD_CNPDD2_MASK                      0x00000004
#define _IOCPDD_CNPDD2_LENGTH                    0x00000001

#define _IOCPDD_CNPDD3_POSITION                  0x00000003
#define _IOCPDD_CNPDD3_MASK                      0x00000008
#define _IOCPDD_CNPDD3_LENGTH                    0x00000001

