MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ512GB606/mcu.h
/*
** Only one invocation of FSEC should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSEC.
** Multiple options may be combined, as shown:
**
** _FSEC( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Write-Protect bit:
**     BWRP_ON              Boot Segment is write protected
**     BWRP_OFF             Boot Segment may be written
**
**   Boot Segment Code-Protect Level bits:
**     BSS_HI               High Security
**     BSS_STD              Standard Security
**     BSS_OFF              No Protection (other than BWRP)
**
**   Boot Segment Control bit:
**     BSEN_ON              Boot Segment size determined by FBSLIM
**     BSEN_OFF             No Boot Segment
**
**   General Segment Write-Protect bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect Level bits:
**     GSS_HI               High Security
**     GSS_STD              Standard Security
**     GSS_OFF              No Protection (other than GWRP)
**
**   Configuration Segment Write-Protect bit:
**     CWRP_ON              Configuration Segment is write protected
**     CWRP_OFF             Configuration Segment may be written
**
**   Configuration Segment Code-Protect Level bits:
**     CSS_HI               High Security
**     CSS_ENH              Enhanced Security
**     CSS_STD              Standard Security
**     CSS_DIS              No Protection (other than CWRP)
**
**   Alternate Interrupt Vector Table bit:
**     AIVTDIS_ENABLE       Enabled AIVT
**     AIVTDIS_DISABLE      Disabled AIVT
**
*/

#define BWRP_ON              0x8FEE
#define BWRP_OFF             0x8FEF

#define BSS_HI               0x8FE9
#define BSS_STD              0x8FED
#define BSS_OFF              0x8FEF

#define BSEN_ON              0x8FE7
#define BSEN_OFF             0x8FEF

#define GWRP_ON              0x8FCF
#define GWRP_OFF             0x8FEF

#define GSS_HI               0x8F2F
#define GSS_STD              0x8FAF
#define GSS_OFF              0x8FEF

#define CWRP_ON              0x8EEF
#define CWRP_OFF             0x8FEF

#define CSS_HI               0x81EF
#define CSS_ENH              0x89EF
#define CSS_STD              0x8DEF
#define CSS_DIS              0x8FEF

#define AIVTDIS_ENABLE       0x0FEF
#define AIVTDIS_DISABLE      0x8FEF

/* Register FBSLIM (0x55f10)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FBSLIM;
#define _FBSLIM(x) __attribute__((address(0x55f10),deprecated_definition("consider migrating to #pragma config"),section("__FBSLIM.sec"),space(prog))) __prog__ uint16_t _FBSLIM = (x);

/*
** Only one invocation of FBSLIM should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FBSLIM.
** Multiple options may be combined, as shown:
**
** _FBSLIM( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Boot Segment Flash Page Address Limit bits:
**     BSLIM_BSLIM          Boot Segment Flash page address  limit
**
*/

#define BSLIM_BSLIM          0x0000

/* Register FSIGN (0x55f14)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FSIGN;
#define _FSIGN(x) __attribute__((address(0x55f14),deprecated_definition("consider migrating to #pragma config"),section("__FSIGN.sec"),space(prog))) __prog__ uint16_t _FSIGN = (x);

/*
** Only one invocation of FSIGN should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FSIGN.
** Multiple options may be combined, as shown:
**
** _FSIGN( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
*/

/* Register FOSCSEL (0x55f18)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FOSCSEL;
#define _FOSCSEL(x) __attribute__((address(0x55f18),deprecated_definition("consider migrating to #pragma config"),section("__FOSCSEL.sec"),space(prog))) __prog__ uint16_t _FOSCSEL = (x);

/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Source Selection:
**     FNOSC_FRC            Internal Fast RC (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with divide-by-N with PLL module (FRCPLL) 
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XT + PLL, HS + PLL, EC + PLL)
**     FNOSC_SOSC           Secondary Oscillator (SOSC)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_DCO            Digitally-Controlled Oscillator
**     FNOSC_OSCFDIV        Oscillator with Frequency Divider
**
**   PLL Mode Selection:
**     PLLMODE_PLL96DIV1    96 MHz PLL.  (4 MHz input)
**     PLLMODE_PLL96DIV2    96 MHz PLL. (8 MHz input)
**     PLLMODE_PLL96DIV3    96 MHz PLL. (12 MHz input)
**     PLLMODE_PLL96DIV4    96 MHz PLL.  (16 MHz input)
**     PLLMODE_PLL96DIV5    96 MHz PLL. (20 MHz input)
**     PLLMODE_PLL96DIV6    96 MHz PLL.  (24 MHz input)
**     PLLMODE_PLL96DIV8    96 MHz PLL.  (32 MHz input)
**     PLLMODE_PLL96DIV12   96 MHz PLL.  (48 MHz input)
**     PLLMODE_PLL4X        4x PLL selected
**     PLLMODE_PLL6X        6x PLL selected
**     PLLMODE_PLL8X        8x PLL selected
**     PLLMODE_DISABLED     No PLL used; PLLEN bit is not available
**
**   Two-speed Oscillator Start-up Enable bit:
**     IESO_OFF             Start up with user-selected oscillator source
**     IESO_ON              Start up device with FRC, then switch to user-selected oscillator source
**
*/

#define FNOSC_FRC            0x00F8
#define FNOSC_FRCPLL         0x00F9
#define FNOSC_PRI            0x00FA
#define FNOSC_PRIPLL         0x00FB
#define FNOSC_SOSC           0x00FC
#define FNOSC_LPRC           0x00FD
#define FNOSC_DCO            0x00FE
#define FNOSC_OSCFDIV        0x00FF

#define PLLMODE_PLL96DIV1    0x0087
#define PLLMODE_PLL96DIV2    0x008F
#define PLLMODE_PLL96DIV3    0x0097
#define PLLMODE_PLL96DIV4    0x009F
#define PLLMODE_PLL96DIV5    0x00A7
#define PLLMODE_PLL96DIV6    0x00AF
#define PLLMODE_PLL96DIV8    0x00B7
#define PLLMODE_PLL96DIV12   0x00BF
#define PLLMODE_PLL4X        0x00E7
#define PLLMODE_PLL6X        0x00EF
#define PLLMODE_PLL8X        0x00F7
#define PLLMODE_DISABLED     0x00FF

#define IESO_OFF             0x007F
#define IESO_ON              0x00FF

